       S8400-GEST-GT.
           IF IQZGSBA-CDRET NOT = WZLT0-GT-RET-OK
              IF IQZGSBA-ERR-NUMERO NOT = WZLT0-GT-ERR-Z1007 AND
                 IQZGSBA-ERR-NUMERO NOT = WZLT0-GT-ERR-Z1009
                 IF ERR-FATALE-NON-ACTIVE
                    PERFORM S8300-ERR-TEC-FAT
                       THRU S8300-ERR-TEC-FAT-FIN
                 END-IF
              END-IF
           END-IF.
       S8400-GEST-GT-FIN. EXIT.

       S8300-ERR-TEC-FAT.
           IF  ERR-FATALE-NON-ACTIVE
               PERFORM S5000-ROLLB        THRU S5000-ROLLB-FIN
           END-IF.
       S8300-ERR-TEC-FAT-FIN. EXIT.

       S5000-ROLLB.
           PERFORM S8100-GEST-SS-PGM THRU S8100-GEST-SS-PGM-FIN.
       S5000-ROLLB-FIN. EXIT.

       S8100-GEST-SS-PGM.
           IF  ERR-ATEC OR
               ERR-SQL  OR
               ERR-FIC
               IF ERR-FATALE-NON-ACTIVE
                  PERFORM S8300-ERR-TEC-FAT THRU S8300-ERR-TEC-FAT-FIN
               END-IF
           END-IF.
       S8100-GEST-SS-PGM-FIN. EXIT.
